In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams["figure.figsize"]= (20, 10)

In [2]:
df= pd.read_csv(r"C:\Users\tausi\Documents\projects\Data Science Projects\Data_Science_Price_Prediction\bengaluru_house_prices.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
df.shape

(13320, 9)

In [4]:
df1 =df[:10]
df1

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

In [5]:
df.groupby('area_type')['area_type'].agg('count')#by agg we can also use sum, avg ,min, max

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [6]:
df2 =df.drop(['area_type', 'availability', 'society', 'balcony'], axis='columns')
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

<b>Deal with null values</b>

In [7]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

<b>Remove Text in the size column except number</b>

In [8]:
df2= df2.replace({
    'size':'[A-Za-z]'}, '', regex=True
)

In [9]:
df2.head()

                   location size total_sqft  bath   price
0  Electronic City Phase II   2        1056   2.0   39.07
1          Chikka Tirupathi   4        2600   5.0  120.00
2               Uttarahalli   3        1440   2.0   62.00
3        Lingadheeranahalli   3        1521   3.0   95.00
4                  Kothanur   2        1200   2.0   51.00

In [10]:
df2['size'].median()

3.0

<b>Take median from size column and replace null values with that median in the size column</b>

In [11]:
df2['size']= df2['size'].fillna(df2['size'].median())
df2.head()

                   location size total_sqft  bath   price
0  Electronic City Phase II   2        1056   2.0   39.07
1          Chikka Tirupathi   4        2600   5.0  120.00
2               Uttarahalli   3        1440   2.0   62.00
3        Lingadheeranahalli   3        1521   3.0   95.00
4                  Kothanur   2        1200   2.0   51.00

In [12]:
df2.isnull().sum()

location       1
size           0
total_sqft     0
bath          73
price          0
dtype: int64

<b>Take median from bath column and replace null values with that median in the bath column</b>

In [13]:
df2['bath']= df2['bath'].fillna(df2['bath'].median())
df2.isnull().sum()

location      1
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [14]:
df2.shape

(13320, 5)

<b>Here we drop 1 null row</b>

In [15]:
df2.dropna(inplace=True)
df2.shape

(13319, 5)

<b>In the total_sqft column we have some different values except float and integer</b>

In [16]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [17]:
df2['total_sqft'].apply(is_float)

0        True
1        True
2        True
3        True
4        True
         ...
13315    True
13316    True
13317    True
13318    True
13319    True
Name: total_sqft, Length: 13319, dtype: bool

In [18]:
df2[df2['total_sqft'].apply(is_float)]

                       location size total_sqft  bath   price
0      Electronic City Phase II   2        1056   2.0   39.07
1              Chikka Tirupathi   4        2600   5.0  120.00
2                   Uttarahalli   3        1440   2.0   62.00
3            Lingadheeranahalli   3        1521   3.0   95.00
4                      Kothanur   2        1200   2.0   51.00
...                         ...  ...        ...   ...     ...
13315                Whitefield   5        3453   4.0  231.00
13316             Richards Town   4        3600   5.0  400.00
13317     Raja Rajeshwari Nagar   2        1141   2.0   60.00
13318           Padmanabhanagar   4        4689   4.0  488.00
13319              Doddathoguru   1         550   1.0   17.00

[13072 rows x 5 columns]

In [19]:
df2[~df2['total_sqft'].apply(is_float)]

                 location size   total_sqft  bath    price
30              Yelahanka   4   2100 - 2850   4.0  186.000
56            Devanahalli   4   3010 - 3410   2.0  192.000
81            Hennur Road   4   2957 - 3450   2.0  224.500
122                Hebbal   4   3067 - 8156   4.0  477.000
137    8th Phase JP Nagar   2   1042 - 1105   2.0   54.005
...                   ...  ...          ...   ...      ...
12990      Talaghattapura   3   1804 - 2273   3.0  122.000
13059              Harlur   2   1200 - 1470   2.0   72.760
13240         Devanahalli   1   1020 - 1130   2.0   52.570
13265               Hoodi   2   1133 - 1384   2.0   59.135
13299          Whitefield   4   2830 - 2882   5.0  154.500

[247 rows x 5 columns]

In [20]:
def float_num(x):
    tokens= x.split("-")
    if len(tokens) == 2:
        return (float(tokens[0]) + float(tokens[1]))/2
    try:
        return float(x)
    except:
        None

In [21]:
float_num('2002')

2002.0

In [22]:
float_num('1133 - 1384')

1258.5

In [23]:
df3 =df2.copy()
df3['total_sqft']=df3['total_sqft'].apply(float_num)
df3.head(3)

                   location size  total_sqft  bath   price
0  Electronic City Phase II   2       1056.0   2.0   39.07
1          Chikka Tirupathi   4       2600.0   5.0  120.00
2               Uttarahalli   3       1440.0   2.0   62.00